hardparking/claude-companion/sdkconfig.defaults
# M5Stack Fire: 16MB flash, 8MB Quad PSRAM, ESP32
CONFIG_IDF_TARGET="esp32"
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_PARTITION_TABLE_SINGLE_APP_LARGE=y

# PSRAM (used for the animation sprite framebuffer)
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_QUAD=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_USE_MALLOC=y

# Smoother timing for the animation loop
CONFIG_FREERTOS_HZ=1000

# A little extra room for the main task
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

# HTTP server
CONFIG_HTTPD_MAX_URI_HANDLERS=12
